In [1]:
import pandas as pd

# Selection

In [2]:
data = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
df = pd.DataFrame(data)
df

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [3]:
df.name == "lily"

0     True
1    False
2    False
3    False
Name: name, dtype: bool

In [4]:
df[df.name == "lily"]

   age  heigh  name
0   23    170  lily

In [5]:
df.name.str.contains("l")

0     True
1     True
2     True
3    False
Name: name, dtype: bool

In [6]:
df[df.name.str.contains("l")]

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul

In [7]:
df[df.name.str.contains("l") & (df.heigh > 170)]

   age  heigh  name
1   40    173  lucy

In [8]:
df.query('age > 10 or name == "lily" ')

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [9]:
df.head(2)

   age  heigh  name
0   23    170  lily
1   40    173  lucy

In [10]:
df.tail(3)

   age  heigh  name
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [11]:
df["age"]

0    23
1    40
2    50
3    71
Name: age, dtype: int64

In [12]:
df[["age","name"]]

   age  name
0   23  lily
1   40  lucy
2   50  paul
3   71   sun

In [13]:
df[0:2]

   age  heigh  name
0   23    170  lily
1   40    173  lucy

In [14]:
df[-2:]

   age  heigh  name
2   50    165  paul
3   71    190   sun

In [15]:
df.iloc[[2,1,0]]

   age  heigh  name
2   50    165  paul
1   40    173  lucy
0   23    170  lily

In [16]:
# row, column
df.iloc[0:2,0:1] # based on position

   age
0   23
1   40

In [17]:
df.loc[[1,3]] #based on label

   age  heigh  name
1   40    173  lucy
3   71    190   sun

In [18]:
df.loc[:, 'age'] #based on label

0    23
1    40
2    50
3    71
Name: age, dtype: int64

In [19]:
df.loc[df.name.str.contains("l")]

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul

In [20]:
df.loc[df.name.str.contains("l"),"name"]

0    lily
1    lucy
2    paul
Name: name, dtype: object

# Merge

In [21]:
ldata = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
left = pd.DataFrame(ldata)

In [22]:
right = pd.DataFrame({"name":["lily","sun"],
                     "score":[30,90]})

In [23]:
left

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [24]:
right

   name  score
0  lily     30
1   sun     90

In [25]:
pd.merge(left,right)

   age  heigh  name  score
0   23    170  lily     30
1   71    190   sun     90

In [26]:
pd.merge(left, right, how="inner", on="name")

   age  heigh  name  score
0   23    170  lily     30
1   71    190   sun     90

In [27]:
pd.merge(left, right, how="left", on="name")

   age  heigh  name  score
0   23    170  lily   30.0
1   40    173  lucy    NaN
2   50    165  paul    NaN
3   71    190   sun   90.0

In [28]:
pd.merge(left, right, how="right", on="name")

   age  heigh  name  score
0   23    170  lily     30
1   71    190   sun     90

In [29]:
right2 = right.copy()
right2 = right2.rename(columns={"name":"right_name"})

In [30]:
right2

  right_name  score
0       lily     30
1        sun     90

In [31]:
pd.merge(left, right2, how="inner", left_on="name", right_on="right_name")

   age  heigh  name right_name  score
0   23    170  lily       lily     30
1   71    190   sun        sun     90

In [32]:
pd.merge(left, right, how="inner", left_index=True, right_index=True)

   age  heigh name_x name_y  score
0   23    170   lily   lily     30
1   40    173   lucy    sun     90

In [33]:
pd.merge(left.set_index("name"), right.set_index("name"), how="inner", left_index=True, right_index=True)

      age  heigh  score
name
lily   23    170     30
sun    71    190     90

# union

In [34]:
ldata = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
left = pd.DataFrame(ldata)
left

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [35]:
pd.concat([left,left])

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [36]:
l2 = left.append(left)

In [37]:
l2

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [38]:
l2[0:2]

   age  heigh  name
0   23    170  lily
1   40    173  lucy

In [39]:
l2.loc[0]

   age  heigh  name
0   23    170  lily
0   23    170  lily

In [40]:
l2.iloc[3]

age       71
heigh    190
name     sun
Name: 3, dtype: object

In [41]:
l2.index.is_unique

False

In [42]:
l2.reset_index()

   index  age  heigh  name
0      0   23    170  lily
1      1   40    173  lucy
2      2   50    165  paul
3      3   71    190   sun
4      0   23    170  lily
5      1   40    173  lucy
6      2   50    165  paul
7      3   71    190   sun

In [43]:
l2.reset_index().index.is_unique

True

# Difference

In [44]:
ldata = {"name": ["lily","lucy","paul","sun"],
        "age": [23,40,50,71],
        "heigh": [170,173,165,190]}
left = pd.DataFrame(ldata)
right = pd.DataFrame({"name":["lily","sun"],
                     "score":[30,90]})

In [45]:
left

   age  heigh  name
0   23    170  lily
1   40    173  lucy
2   50    165  paul
3   71    190   sun

In [46]:
right

   name  score
0  lily     30
1   sun     90

In [47]:
left.name.isin(right.name)

0     True
1    False
2    False
3     True
Name: name, dtype: bool

In [48]:
mask = left.name.isin(right.name)
df[mask]

   age  heigh  name
0   23    170  lily
3   71    190   sun